Revit 2024 API
BuiltInFailures.RebarFailures.InvalidRebarHost Property
 Rebar can be placed only in Concrete Structural elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidRebarHost { get; }
Visual Basic
Public Shared ReadOnly Property InvalidRebarHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidRebarHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace